column-sizes.org


W = 1floor ko wt square area ma  + Live load + Dead Load 

P = W*(N-1) + Slab (same area ma) (No dead load or live load)
Pu = P * 1.5 

N = 7, 12, 16
BW = 3,5,7 

fck = 25 
fy = 500 
As = 1.5% Ag 
=> Ag -> round up.

formula from  [[/mnt/Data/Documents/Civil Engineering/Books and Standards/Indian Codes/IS 456/IS 456-2000.pdf::72][is 456]]


* Code for calculating Pu
  load moi.lisp
  #+begin_src lisp
    (defparameter *sg* (make-structural-geometry)) ;; all default dimensions
    (defparameter *fck* 25)
    (defparameter *%steel* 0.015)

    (defun P (N h bw cw)
      (with-slots (beam-height slab-thickness wall-thickness floor-loads) *sg*
	(let*
	    ((beam-width 0.3) ;; or beam-width = cw
	     (wall-length (/ (- bw cw) 2))
	     (wall   (* 4 wall-length wall-thickness  (- h beam-height) 20))
	     (beam   (* 4 wall-length beam-width      (- beam-height slab-thickness)          25))
	     (slab   (*   bw          bw              slab-thickness       25))
	     (column (*   cw          cw              (- h slab-thickness) 25))
	     (loads  (* floor-loads (- (* bw bw) (* cw cw) (* 4 wall-length wall-thickness)))))
	  (+ (* (1- n)
		(+ wall beam slab column loads))
	     slab))))

    (defun Pu (N h bw cw)
      "Return Pu in (kN)"
      (* 1.5 (P N h bw cw)))

    (defun A (Pu &optional (fck *fck*) (fy 500))
      "Returns Ac in mm"
      (/ (* 1000 Pu)
	 (+ (* 0.4 fck (- 1 *%steel*))
	    (* .67 fy *%steel*))))

    (defun column-width (N h bw cw)
      "Gives new estimate of cw (in m)"
      (/ (sqrt (A (Pu N h bw cw)))
	 1000))

    (defun converge (N h bw &optional (cw 0.3) (tolerance 0.001))
      (let ((new-cw (column-width N h bw cw)))
	(if (< (abs (- cw new-cw)) tolerance)
	    new-cw
	    (converge N h bw new-cw))))

    (defun round-up (cw)
      (max 0.3 (/ (ceiling (* cw 20))
		  20)))

  #+end_src

  #+RESULTS:
  : ROUND-UP

* Sample Calculation
  Take N=5, h = 3 , bay width bw =4 and column-width cw = 0.3
  #+begin_src lisp :results output
    (with-reporting :default
      (P 5 3 4 0.3))
  #+end_src

  #+RESULTS:
  | (BEAM-WIDTH)  | = 0.3 =                                                                    |                  0.3 |
  | (WALL-LENGTH) | = (/ (- BW CW) 2) =                                                        |                 1.85 |
  | (WALL)        | = (* 4 WALL-LENGTH WALL-THICKNESS (- H BEAM-HEIGHT) 20) =                  |               85.1d0 |
  | (BEAM)        | = (* 4 WALL-LENGTH BEAM-WIDTH (- BEAM-HEIGHT SLAB-THICKNESS) 25) =         | 19.425001335144042d0 |
  | (SLAB)        | = (* BW BW SLAB-THICKNESS 25) =                                            |               60.0d0 |
  | (COLUMN)      | = (* CW CW (- H SLAB-THICKNESS) 25) =                                      |  6.412500254809856d0 |
  | (LOADS)       | = (* FLOOR-LOADS (- (* BW BW) (* CW CW) (* 4 WALL-LENGTH WALL-THICKNESS))) | = 49.7279993891716d0 |
  | Finally P     | 942.662                                                                    |                      |

  This P is in kN
  now assuming in IS 456 formula Pu is in Newton and A is in mmq

  #+begin_src lisp  :exports both
    (column-width 5 3 4 0.3)
  #+end_src

  #+RESULTS:
  : 0\.3083153472276686d0

  Now this gives new estimate of 0.313 which can then be used to get new estimate and so on. And finally
  #+begin_src lisp :exports both 
    (converge 5 3 4 0.3)
  #+end_src

  #+RESULTS:
  : 0\.30839460699500837d0

