column-sizes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-10 Fri 12:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge56aa4e">1. Code for calculating Pu</a></li>
<li><a href="#org7498fbb">2. Sample Calculation</a></li>
<li><a href="#orgbcd5170">3. Table</a></li>
<li><a href="#org045b617">4. Table 2</a>
<ul>
<li><a href="#orgae513b5">4.1. Grid</a>
<ul>
<li><a href="#org24b2590">4.1.1. Only final sizes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
W = 1floor ko wt square area ma  + Live load + Dead Load 
</p>

<p>
P = W*(N-1) + Slab (same area ma) (No dead load or live load)
Pu = P * 1.5 
</p>

<p>
N = 7, 12, 16
BW = 3,5,7 
</p>

<p>
fck = 25 
fy = 500 
As = 1.5% Ag 
=&gt; Ag -&gt; round up.
</p>

<p>
formula from  <a href="file:///mnt/Data/Documents/Civil Engineering/Books and Standards/Indian Codes/IS 456/IS 456-2000.pdf#MissingReference">is 456</a>
</p>


<div id="outline-container-orge56aa4e" class="outline-2">
<h2 id="orge56aa4e"><span class="section-number-2">1</span> Code for calculating Pu</h2>
<div class="outline-text-2" id="text-1">
<p>
load moi.lisp
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #268bd2; font-weight: bold;">defparameter</span> <span style="color: #8787d7;">*sg*</span> (make-structural-geometry)) <span style="color: #008787; background-color: #262626;">;; </span><span style="color: #008787; background-color: #262626;">all default dimensions</span>
(<span style="color: #268bd2; font-weight: bold;">defparameter</span> <span style="color: #8787d7;">*fck*</span> 25)
(<span style="color: #268bd2; font-weight: bold;">defparameter</span> <span style="color: #8787d7;">*%steel*</span> 0.015)

(<span style="color: #268bd2; font-weight: bold;">defun</span> <span style="color: #d75fd7; font-weight: bold;">P</span> (N h bw cw)
  (<span style="color: #268bd2; font-weight: bold;">with-slots</span> (beam-height slab-thickness wall-thickness floor-loads) *sg*
    (<span style="color: #268bd2; font-weight: bold;">let*</span>
        ((beam-width 0.3) <span style="color: #008787; background-color: #262626;">;; </span><span style="color: #008787; background-color: #262626;">or beam-width = cw</span>
         (wall-length (/ (- bw cw) 2))
         (wall   (* 4 wall-length wall-thickness  (- h beam-height) 20))
         (beam   (* 4 wall-length beam-width      (- beam-height slab-thickness)          25))
         (slab   (*   bw          bw              slab-thickness       25))
         (column (*   cw          cw              (- h slab-thickness) 25))
         (loads  (* floor-loads (- (* bw bw) (* cw cw) (* 4 wall-length wall-thickness)))))
      (+ (* (1- n)
            (+ wall beam slab column loads))
         slab))))

(<span style="color: #268bd2; font-weight: bold;">defun</span> <span style="color: #d75fd7; font-weight: bold;">Pu</span> (N h bw cw)
  <span style="color: #af875f;">"Return Pu in (kN)"</span>
  (* 1.5 (P N h bw cw)))

(<span style="color: #268bd2; font-weight: bold;">defun</span> <span style="color: #d75fd7; font-weight: bold;">A</span> (Pu <span style="color: #df005f; font-weight: bold;">&amp;optional</span> (fck *fck*) (fy 500))
  <span style="color: #af875f;">"Returns Ac in mm"</span>
  (/ (* 1000 Pu)
     (+ (* 0.4 fck (- 1 *%steel*))
        (* .67 fy *%steel*))))

(<span style="color: #268bd2; font-weight: bold;">defun</span> <span style="color: #d75fd7; font-weight: bold;">column-width</span> (N h bw cw)
  <span style="color: #af875f;">"Gives new estimate of cw (in m)"</span>
  (/ (sqrt (A (Pu N h bw cw)))
     1000))

(<span style="color: #268bd2; font-weight: bold;">defun</span> <span style="color: #d75fd7; font-weight: bold;">converge</span> (N h bw <span style="color: #df005f; font-weight: bold;">&amp;optional</span> (cw 0.3) (tolerance 0.001))
  (<span style="color: #268bd2; font-weight: bold;">let</span> ((new-cw (column-width N h bw cw)))
    (<span style="color: #268bd2; font-weight: bold;">if</span> (&lt; (abs (- cw new-cw)) tolerance)
        new-cw
        (converge N h bw new-cw))))

(<span style="color: #268bd2; font-weight: bold;">defun</span> <span style="color: #d75fd7; font-weight: bold;">round-up</span> (cw)
  (max 0.3 (/ (ceiling (* cw 20))
              20)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org7498fbb" class="outline-2">
<h2 id="org7498fbb"><span class="section-number-2">2</span> Sample Calculation</h2>
<div class="outline-text-2" id="text-2">
<p>
Take N=5, h = 3 , bay width bw =4 and column-width cw = 0.3
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #268bd2; font-weight: bold;">with-reporting</span> <span style="color: #268bd2;">:default</span>
  (P 5 3 4 0.3))
</pre>
</div>

<p>
This P is in kN
now assuming in IS 456 formula Pu is in Newton and A is in mmq
</p>

<div class="org-src-container">
<pre class="src src-lisp">(column-width 5 3 4 0.3)
</pre>
</div>

<pre class="example">
0\.3083153472276686d0
</pre>


<p>
Now this gives new estimate of 0.313 which can then be used to get new estimate and so on. And finally
</p>
<div class="org-src-container">
<pre class="src src-lisp">(converge 5 3 4 0.3)
</pre>
</div>

<pre class="example">
0\.30839460699500837d0
</pre>
</div>
</div>
