column-sizes.org
* Table
  #+begin_src lisp :exports both 
    (table 3
      (row "N" "fck" "%steel" "h" "bw" "Cw" "Cw (rounded)" "Pu" )
      (loop
	for N in '(3 7 12 16)
	for *fck* in '(25 25 30 30)
	for *%steel* in '(0.03 0.03 0.04 0.04) do 
	  (loop for bw in '(3 5 7) do 
	    (loop 
	      for h in '(2.5 3 4) 
	      for cw = (column-width n h bw 0.3)
	      for rounded-cw = (coerce (round-up cw) 'single-float)
	      for Pu = (Pu n h bw rounded-cw) do 
		(row n *fck* *%steel* h bw cw rounded-cw  Pu)))))


  #+end_src   

  #+Name: column-size-and-fck
  #+RESULTS:
  |      N |    fck | %steel |     h |    bw |    Cw | Cw (rounded) |        Pu |
  |  3.000 | 25.000 |  0.030 | 2.500 | 3.000 | 0.149 |        0.300 |   439.816 |
  |  3.000 | 25.000 |  0.030 | 3.000 | 3.000 | 0.156 |        0.300 |   480.451 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 3.000 | 0.169 |        0.300 |   561.721 |
  |  3.000 | 25.000 |  0.030 | 2.500 | 5.000 | 0.226 |        0.300 |  1010.056 |
  |  3.000 | 25.000 |  0.030 | 3.000 | 5.000 | 0.234 |        0.300 |  1078.292 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 5.000 | 0.248 |        0.300 |  1214.762 |
  |  3.000 | 25.000 |  0.030 | 2.500 | 7.000 | 0.302 |        0.350 |  1801.377 |
  |  3.000 | 25.000 |  0.030 | 3.000 | 7.000 | 0.310 |        0.350 |  1897.741 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 7.000 | 0.325 |        0.350 |  2090.469 |
  |  7.000 | 25.000 |  0.030 | 2.500 | 3.000 | 0.248 |        0.300 |  1218.199 |
  |  7.000 | 25.000 |  0.030 | 3.000 | 3.000 | 0.260 |        0.300 |  1340.104 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 3.000 | 0.283 |        0.300 |  1583.914 |
  |  7.000 | 25.000 |  0.030 | 2.500 | 5.000 | 0.373 |        0.400 |  2763.891 |
  |  7.000 | 25.000 |  0.030 | 3.000 | 5.000 | 0.387 |        0.400 |  2972.331 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 5.000 | 0.413 |        0.450 |  3408.560 |
  |  7.000 | 25.000 |  0.030 | 2.500 | 7.000 | 0.495 |        0.500 |  4886.528 |
  |  7.000 | 25.000 |  0.030 | 3.000 | 7.000 | 0.510 |        0.550 |  5203.776 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 7.000 | 0.538 |        0.550 |  5805.899 |
  | 12.000 | 30.000 |  0.040 | 2.500 | 3.000 | 0.297 |        0.300 |  2191.178 |
  | 12.000 | 30.000 |  0.040 | 3.000 | 3.000 | 0.311 |        0.350 |  2429.024 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 3.000 | 0.339 |        0.350 |  2881.825 |
  | 12.000 | 30.000 |  0.040 | 2.500 | 5.000 | 0.444 |        0.450 |  4970.507 |
  | 12.000 | 30.000 |  0.040 | 3.000 | 5.000 | 0.461 |        0.500 |  5388.739 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 5.000 | 0.493 |        0.500 |  6174.964 |
  | 12.000 | 30.000 |  0.040 | 2.500 | 7.000 | 0.589 |        0.600 |  8792.859 |
  | 12.000 | 30.000 |  0.040 | 3.000 | 7.000 | 0.607 |        0.650 |  9400.758 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 7.000 | 0.641 |        0.650 | 10538.969 |
  | 16.000 | 30.000 |  0.040 | 2.500 | 3.000 | 0.345 |        0.350 |  2985.168 |
  | 16.000 | 30.000 |  0.040 | 3.000 | 3.000 | 0.362 |        0.400 |  3321.090 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 3.000 | 0.395 |        0.400 |  3949.290 |
  | 16.000 | 30.000 |  0.040 | 2.500 | 5.000 | 0.517 |        0.550 |  6801.550 |
  | 16.000 | 30.000 |  0.040 | 3.000 | 5.000 | 0.537 |        0.550 |  7347.203 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 5.000 | 0.574 |        0.600 |  8518.185 |
  | 16.000 | 30.000 |  0.040 | 2.500 | 7.000 | 0.685 |        0.700 | 12002.051 |
  | 16.000 | 30.000 |  0.040 | 3.000 | 7.000 | 0.706 |        0.750 | 12872.461 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 7.000 | 0.746 |        0.750 | 14482.617 |

