column-sizes.html

<div id="outline-container-orgbcd5170" class="outline-2">
<h2 id="orgbcd5170"><span class="section-number-2">3</span> Table</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-lisp">(table 3
  (row <span style="color: #2aa198;">"N"</span> <span style="color: #2aa198;">"fck"</span> <span style="color: #2aa198;">"%steel"</span> <span style="color: #2aa198;">"h"</span> <span style="color: #2aa198;">"bw"</span> <span style="color: #2aa198;">"Cw"</span> <span style="color: #2aa198;">"Cw (rounded)"</span> <span style="color: #2aa198;">"Pu"</span> )
  (<span style="color: #268bd2; font-weight: bold;">loop</span>
    for N in '(3 7 12 16)
    for *fck* in '(25 25 30 30)
    for *%steel* in '(0.03 0.03 0.04 0.04) do 
      (<span style="color: #268bd2; font-weight: bold;">loop</span> for bw in '(3 5 7) do 
        (<span style="color: #268bd2; font-weight: bold;">loop</span> 
          for h in '(2.5 3 4) 
          for cw = (column-width n h bw 0.3)
          for rounded-cw = (coerce (round-up cw) 'single-float)
          for Pu = (Pu n h bw rounded-cw) do 
            (row n *fck* *%steel* h bw cw rounded-cw  Pu)))))


</pre>
</div>

<table id="orgcdf5217" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">N</td>
<td class="org-right">fck</td>
<td class="org-right">%steel</td>
<td class="org-right">h</td>
<td class="org-right">bw</td>
<td class="org-right">Cw</td>
<td class="org-right">Cw (rounded)</td>
<td class="org-right">Pu</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">2.500</td>
<td class="org-right">3.000</td>
<td class="org-right">0.149</td>
<td class="org-right">0.300</td>
<td class="org-right">439.816</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">3.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.156</td>
<td class="org-right">0.300</td>
<td class="org-right">480.451</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">4.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.169</td>
<td class="org-right">0.300</td>
<td class="org-right">561.721</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">2.500</td>
<td class="org-right">5.000</td>
<td class="org-right">0.226</td>
<td class="org-right">0.300</td>
<td class="org-right">1010.056</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">3.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.234</td>
<td class="org-right">0.300</td>
<td class="org-right">1078.292</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">4.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.248</td>
<td class="org-right">0.300</td>
<td class="org-right">1214.762</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">2.500</td>
<td class="org-right">7.000</td>
<td class="org-right">0.302</td>
<td class="org-right">0.350</td>
<td class="org-right">1801.377</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">3.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.310</td>
<td class="org-right">0.350</td>
<td class="org-right">1897.741</td>
</tr>

<tr>
<td class="org-right">3.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">4.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.325</td>
<td class="org-right">0.350</td>
<td class="org-right">2090.469</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">2.500</td>
<td class="org-right">3.000</td>
<td class="org-right">0.248</td>
<td class="org-right">0.300</td>
<td class="org-right">1218.199</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">3.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.260</td>
<td class="org-right">0.300</td>
<td class="org-right">1340.104</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">4.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.283</td>
<td class="org-right">0.300</td>
<td class="org-right">1583.914</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">2.500</td>
<td class="org-right">5.000</td>
<td class="org-right">0.373</td>
<td class="org-right">0.400</td>
<td class="org-right">2763.891</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">3.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.387</td>
<td class="org-right">0.400</td>
<td class="org-right">2972.331</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">4.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.413</td>
<td class="org-right">0.450</td>
<td class="org-right">3408.560</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">2.500</td>
<td class="org-right">7.000</td>
<td class="org-right">0.495</td>
<td class="org-right">0.500</td>
<td class="org-right">4886.528</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">3.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.510</td>
<td class="org-right">0.550</td>
<td class="org-right">5203.776</td>
</tr>

<tr>
<td class="org-right">7.000</td>
<td class="org-right">25.000</td>
<td class="org-right">0.030</td>
<td class="org-right">4.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.538</td>
<td class="org-right">0.550</td>
<td class="org-right">5805.899</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">2.500</td>
<td class="org-right">3.000</td>
<td class="org-right">0.297</td>
<td class="org-right">0.300</td>
<td class="org-right">2191.178</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">3.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.311</td>
<td class="org-right">0.350</td>
<td class="org-right">2429.024</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">4.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.339</td>
<td class="org-right">0.350</td>
<td class="org-right">2881.825</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">2.500</td>
<td class="org-right">5.000</td>
<td class="org-right">0.444</td>
<td class="org-right">0.450</td>
<td class="org-right">4970.507</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">3.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.461</td>
<td class="org-right">0.500</td>
<td class="org-right">5388.739</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">4.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.493</td>
<td class="org-right">0.500</td>
<td class="org-right">6174.964</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">2.500</td>
<td class="org-right">7.000</td>
<td class="org-right">0.589</td>
<td class="org-right">0.600</td>
<td class="org-right">8792.859</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">3.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.607</td>
<td class="org-right">0.650</td>
<td class="org-right">9400.758</td>
</tr>

<tr>
<td class="org-right">12.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">4.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.641</td>
<td class="org-right">0.650</td>
<td class="org-right">10538.969</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">2.500</td>
<td class="org-right">3.000</td>
<td class="org-right">0.345</td>
<td class="org-right">0.350</td>
<td class="org-right">2985.168</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">3.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.362</td>
<td class="org-right">0.400</td>
<td class="org-right">3321.090</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">4.000</td>
<td class="org-right">3.000</td>
<td class="org-right">0.395</td>
<td class="org-right">0.400</td>
<td class="org-right">3949.290</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">2.500</td>
<td class="org-right">5.000</td>
<td class="org-right">0.517</td>
<td class="org-right">0.550</td>
<td class="org-right">6801.550</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">3.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.537</td>
<td class="org-right">0.550</td>
<td class="org-right">7347.203</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">4.000</td>
<td class="org-right">5.000</td>
<td class="org-right">0.574</td>
<td class="org-right">0.600</td>
<td class="org-right">8518.185</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">2.500</td>
<td class="org-right">7.000</td>
<td class="org-right">0.685</td>
<td class="org-right">0.700</td>
<td class="org-right">12002.051</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">3.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.706</td>
<td class="org-right">0.750</td>
<td class="org-right">12872.461</td>
</tr>

<tr>
<td class="org-right">16.000</td>
<td class="org-right">30.000</td>
<td class="org-right">0.040</td>
<td class="org-right">4.000</td>
<td class="org-right">7.000</td>
<td class="org-right">0.746</td>
<td class="org-right">0.750</td>
<td class="org-right">14482.617</td>
</tr>
</tbody>
</table>
