column-sizes.org
* Importing 
  #+begin_src lisp :var data=column-size-and-fck :colnames true 
    (loop for (n0 fck %steel h bw cw% cw pu) in data
	  for Ec = (Ec% fck) do
	    (loop for n in (cdr (find n0 '((3 . (1 2 3))
					   (7 . (4 5 6 7))
					   (12 . (8 9 10 11 12))
					   (16 . (13 14 15 16)))
				      :key #'car
				      :test #'=)) do
					(setf (cs-and-Ec n h bw) (list cw Ec))))
  #+end_src

  #+RESULTS:
  : NIL



* Table 2
  #+begin_src lisp :exports both 
    (table 3
      (row "N" "fck" "%steel" "h" "bw" "Cw" "Cw (rounded)" "Pu" )
      (loop
	for N in '(3 7 12 16)
	for *fck* in '(25 25 30 30)
	for *%steel* in '(0.03 0.03 0.04 0.04) do 
	  (loop for bw in '(3 3.5 4 4.5 5 5.5 6 6.5 7)
		with h = 4 
		for cw = (column-width n h bw 0.3)
		for rounded-cw = (coerce (round-up cw) 'single-float)
		for Pu = (Pu n h bw rounded-cw) do 
		  (row n *fck* *%steel* h bw cw rounded-cw  Pu))))


  #+end_src   

  #+RESULTS:
  |      N |    fck | %steel |     h |    bw |    Cw | Cw (rounded) |        Pu |
  |  3.000 | 25.000 |  0.030 | 4.000 | 3.000 | 0.169 |        0.300 |   561.721 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 3.500 | 0.189 |        0.300 |   704.450 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 4.000 | 0.209 |        0.300 |   860.867 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 4.500 | 0.228 |        0.300 |  1030.970 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 5.000 | 0.248 |        0.300 |  1214.762 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 5.500 | 0.267 |        0.300 |  1412.240 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 6.000 | 0.287 |        0.300 |  1623.407 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 6.500 | 0.306 |        0.350 |  1851.927 |
  |  3.000 | 25.000 |  0.030 | 4.000 | 7.000 | 0.325 |        0.350 |  2090.469 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 3.000 | 0.283 |        0.300 |  1583.914 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 3.500 | 0.316 |        0.350 |  1986.540 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 4.000 | 0.349 |        0.350 |  2413.601 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 4.500 | 0.381 |        0.400 |  2891.275 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 5.000 | 0.413 |        0.450 |  3408.560 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 5.500 | 0.444 |        0.450 |  3941.934 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 6.000 | 0.475 |        0.500 |  4534.267 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 6.500 | 0.507 |        0.550 |  5166.213 |
  |  7.000 | 25.000 |  0.030 | 4.000 | 7.000 | 0.538 |        0.550 |  5805.899 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 3.000 | 0.339 |        0.350 |  2881.825 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 3.500 | 0.378 |        0.400 |  3612.389 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 4.000 | 0.417 |        0.450 |  4413.229 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 4.500 | 0.455 |        0.500 |  5284.346 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 5.000 | 0.493 |        0.500 |  6174.964 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 5.500 | 0.530 |        0.550 |  7178.983 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 6.000 | 0.567 |        0.600 |  8253.279 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 6.500 | 0.604 |        0.650 |  9397.852 |
  | 12.000 | 30.000 |  0.040 | 4.000 | 7.000 | 0.641 |        0.650 | 10538.969 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 3.000 | 0.395 |        0.400 |  3949.290 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 3.500 | 0.441 |        0.450 |  4949.300 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 4.000 | 0.485 |        0.500 |  6044.119 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 4.500 | 0.530 |        0.550 |  7233.747 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 5.000 | 0.574 |        0.600 |  8518.185 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 5.500 | 0.617 |        0.650 |  9897.432 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 6.000 | 0.660 |        0.700 | 11371.489 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 6.500 | 0.703 |        0.750 | 12940.355 |
  | 16.000 | 30.000 |  0.040 | 4.000 | 7.000 | 0.746 |        0.750 | 14482.617 |

