column-sizes.html


<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #268bd2; font-weight: bold;">loop</span> for (n0 fck %steel h bw cw% cw pu) in data
      for Ec = (Ec% fck) do
        (<span style="color: #268bd2; font-weight: bold;">loop</span> for n in (cdr (find n0 '((3 . (1 2 3))
                                       (7 . (4 5 6 7))
                                       (12 . (8 9 10 11 12))
                                       (16 . (13 14 15 16)))
                                  <span style="color: #268bd2;">:key</span> #'car
                                  <span style="color: #268bd2;">:test</span> #'=)) <span style="color: #dc752f; background-color: #262626;">do</span>
                                    (setf (cs-and-Ec n h bw) (list cw Ec))))
</pre>
</div>
</div>
</div>
