column-sizes.org
*** Only final sizes
    #+begin_src lisp :var data=column-sizes :exports both :colnames true
      (loop for (N . s) in data 
	    collect (cons N  (loop for val  in s
			     for (cs cs-round) = (read-from-string val)
				   collect cs-round)))
    #+end_src


    #+RESULTS:
    | N / bw->> |  3.0 |  3.5 |  4.0 |  4.5 |  5.0 |  5.5 |  6.0 |  6.5 |  7.0 |
    |-----------+------+------+------+------+------+------+------+------+------|
    |       1.0 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |
    |       2.0 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |
    |       3.0 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 | 0.35 | 0.35 |
    |       4.0 |  0.3 |  0.3 |  0.3 |  0.3 |  0.3 | 0.35 | 0.35 |  0.4 |  0.4 |
    |       5.0 |  0.3 |  0.3 |  0.3 | 0.35 | 0.35 |  0.4 |  0.4 | 0.45 | 0.45 |
    |       6.0 |  0.3 |  0.3 | 0.35 | 0.35 |  0.4 | 0.45 | 0.45 |  0.5 |  0.5 |
    |       7.0 |  0.3 | 0.35 | 0.35 |  0.4 | 0.45 | 0.45 |  0.5 | 0.55 | 0.55 |
    |       8.0 |  0.3 | 0.35 | 0.35 |  0.4 |  0.4 | 0.45 |  0.5 |  0.5 | 0.55 |
    |       9.0 |  0.3 | 0.35 |  0.4 |  0.4 | 0.45 |  0.5 |  0.5 | 0.55 | 0.55 |
    |      10.0 | 0.35 | 0.35 |  0.4 | 0.45 | 0.45 |  0.5 | 0.55 | 0.55 |  0.6 |
    |      11.0 | 0.35 |  0.4 |  0.4 | 0.45 |  0.5 | 0.55 | 0.55 |  0.6 | 0.65 |
    |      12.0 | 0.35 |  0.4 | 0.45 |  0.5 |  0.5 | 0.55 |  0.6 | 0.65 | 0.65 |
    |      13.0 |  0.4 |  0.4 | 0.45 |  0.5 | 0.55 |  0.6 |  0.6 | 0.65 |  0.7 |
    |      14.0 |  0.4 | 0.45 |  0.5 |  0.5 | 0.55 |  0.6 | 0.65 |  0.7 |  0.7 |
    |      15.0 |  0.4 | 0.45 |  0.5 | 0.55 |  0.6 |  0.6 | 0.65 |  0.7 | 0.75 |
    |      16.0 |  0.4 | 0.45 |  0.5 | 0.55 |  0.6 | 0.65 |  0.7 | 0.75 | 0.75 |
*** Importing 2
  #+begin_src lisp 
    (loop
      for N from 1 to 16 
      for *fck* = (if (> N 7) 30 25) 
      for *%steel* = (if (> N 7) 0.04 0.03) do
	(loop for bw from 3 to 7 by 0.5 
	      with h = 4 
	      for cw = (column-width n h bw 0.3)
	      for rounded-cw = (coerce (round-up cw) 'single-float)
	      for Ec = (Ec% *fck*) do 
	      (setf (cs-and-ec n h bw) (list rounded-cw Ec))))

    ,*column-sizes-and-ecs*
  #+end_src

  #+RESULTS:
  : #<HASH-TABLE :TEST EQUAL :COUNT 144 {100944B473}>

